tube/15cm_0.75mm_15mlmin_11cells/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    walls
    {
        type            noSlip;
    }

    inlet
    {
		type        flowRateInletVelocity;	
		volumetricFlowRate    0.0000002499;        // Volumetric/mass flow rate [m3/s or kg/s]
		value       uniform (0 0 0); // placeholder
		extrapolateProfile	true;
    }

    outlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
